http/server/latency_all.log
Running Tests: Bare Metal
Concurrency level: 1
Runlength: 10s
Baseline: Pure HTTP forwarding
  % Total    % Received % Xferd  Average Speed   Time    Time     Time  Current
                                 Dload  Upload   Total   Spent    Left  Speed
100    43  100    43    0     0   6142      0 --:--:-- --:--:-- --:--:--  6142
hello:broot:/:hello:bbranch:/:hello:bleaf:/

Summary:
  Total:	10.0019 secs
  Slowest:	0.0030 secs
  Fastest:	0.0006 secs
  Average:	0.0014 secs
  Requests/sec:	727.6620
  
  Total data:	312954 bytes
  Size/request:	43 bytes

Response time histogram:
  0.001 [1]	|
  0.001 [518]	|■■■■■■
  0.001 [354]	|■■■■
  0.001 [1000]	|■■■■■■■■■■■
  0.002 [3767]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.002 [1634]	|■■■■■■■■■■■■■■■■■
  0.002 [2]	|
  0.002 [1]	|
  0.003 [0]	|
  0.003 [0]	|
  0.003 [1]	|


Latency distribution:
  10% in 0.0010 secs
  25% in 0.0013 secs
  50% in 0.0014 secs
  75% in 0.0015 secs
  90% in 0.0016 secs
  95% in 0.0016 secs
  99% in 0.0017 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0000 secs, 0.0006 secs, 0.0030 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0008 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0002 secs
  resp wait:	0.0013 secs, 0.0005 secs, 0.0021 secs
  resp read:	0.0001 secs, 0.0000 secs, 0.0002 secs

Status code distribution:
  [200]	7278 responses



Underload
  % Total    % Received % Xferd  Average Speed   Time    Time     Time  Current
                                 Dload  Upload   Total   Spent    Left  Speed
100    55  100    55    0     0   9166      0 --:--:-- --:--:-- --:--:--  9166
hello:broot:/load:hello:bbranch:/load:hello:bleaf:/load

Summary:
  Total:	10.0011 secs
  Slowest:	0.0104 secs
  Fastest:	0.0002 secs
  Average:	0.0006 secs
  Requests/sec:	1633.3206
  
  Total data:	702405 bytes
  Size/request:	43 bytes

Response time histogram:
  0.000 [1]	|
  0.001 [14119]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.002 [1492]	|■■■■
  0.003 [318]	|■
  0.004 [327]	|■
  0.005 [25]	|
  0.006 [35]	|
  0.007 [4]	|
  0.008 [9]	|
  0.009 [2]	|
  0.010 [3]	|


Latency distribution:
  10% in 0.0003 secs
  25% in 0.0003 secs
  50% in 0.0003 secs
  75% in 0.0004 secs
  90% in 0.0020 secs
  95% in 0.0022 secs
  99% in 0.0038 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0000 secs, 0.0002 secs, 0.0104 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0009 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0002 secs
  resp wait:	0.0005 secs, 0.0002 secs, 0.0102 secs
  resp read:	0.0000 secs, 0.0000 secs, 0.0017 secs

Status code distribution:
  [200]	16335 responses



  % Total    % Received % Xferd  Average Speed   Time    Time     Time  Current
                                 Dload  Upload   Total   Spent    Left  Speed
100   112  100   112    0     0     11      0  0:00:10  0:00:10 --:--:--    29
status[1/1],hello:broot:/load-status:status[1/1],hello:bbranch:/load-status:status[1/1],hello:bleaf:/load-status
Running Tests: Host local containers
Concurrency level: 1
Runlength: 10s
Baseline: Pure HTTP forwarding
  % Total    % Received % Xferd  Average Speed   Time    Time     Time  Current
                                 Dload  Upload   Total   Spent    Left  Speed
100    43  100    43    0     0   4777      0 --:--:-- --:--:-- --:--:--  4777
hello:lroot:/:hello:lbranch:/:hello:lleaf:/

Summary:
  Total:	10.0009 secs
  Slowest:	0.0085 secs
  Fastest:	0.0006 secs
  Average:	0.0014 secs
  Requests/sec:	693.7396
  
  Total data:	298334 bytes
  Size/request:	43 bytes

Response time histogram:
  0.001 [1]	|
  0.001 [1546]	|■■■■■■■■■■■
  0.002 [5389]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.003 [1]	|
  0.004 [0]	|
  0.005 [0]	|
  0.005 [0]	|
  0.006 [0]	|
  0.007 [0]	|
  0.008 [0]	|
  0.009 [1]	|


Latency distribution:
  10% in 0.0012 secs
  25% in 0.0014 secs
  50% in 0.0015 secs
  75% in 0.0016 secs
  90% in 0.0016 secs
  95% in 0.0016 secs
  99% in 0.0017 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0000 secs, 0.0006 secs, 0.0085 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0006 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0002 secs
  resp wait:	0.0013 secs, 0.0005 secs, 0.0084 secs
  resp read:	0.0001 secs, 0.0000 secs, 0.0003 secs

Status code distribution:
  [200]	6938 responses



Underload
  % Total    % Received % Xferd  Average Speed   Time    Time     Time  Current
                                 Dload  Upload   Total   Spent    Left  Speed
100    55  100    55    0     0   9166      0 --:--:-- --:--:-- --:--:--  9166
hello:lroot:/load:hello:lbranch:/load:hello:lleaf:/load

Summary:
  Total:	10.0006 secs
  Slowest:	0.0090 secs
  Fastest:	0.0003 secs
  Average:	0.0005 secs
  Requests/sec:	1906.0933
  
  Total data:	819666 bytes
  Size/request:	43 bytes

Response time histogram:
  0.000 [1]	|
  0.001 [17758]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.002 [118]	|
  0.003 [964]	|■■
  0.004 [121]	|
  0.005 [39]	|
  0.006 [36]	|
  0.006 [11]	|
  0.007 [7]	|
  0.008 [3]	|
  0.009 [4]	|


Latency distribution:
  10% in 0.0003 secs
  25% in 0.0003 secs
  50% in 0.0004 secs
  75% in 0.0004 secs
  90% in 0.0004 secs
  95% in 0.0025 secs
  99% in 0.0029 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0000 secs, 0.0003 secs, 0.0090 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0007 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0001 secs
  resp wait:	0.0004 secs, 0.0002 secs, 0.0089 secs
  resp read:	0.0000 secs, 0.0000 secs, 0.0003 secs

Status code distribution:
  [200]	19062 responses



  % Total    % Received % Xferd  Average Speed   Time    Time     Time  Current
                                 Dload  Upload   Total   Spent    Left  Speed
100   112  100   112    0     0     11      0  0:00:10  0:00:10 --:--:--    29
status[1/1],hello:lroot:/load-status:status[1/1],hello:lbranch:/load-status:status[1/1],hello:lleaf:/load-status
Running Tests: Containers
Concurrency level: 1
Runlength: 10s
Baseline: Pure HTTP forwarding
  % Total    % Received % Xferd  Average Speed   Time    Time     Time  Current
                                 Dload  Upload   Total   Spent    Left  Speed
100    43  100    43    0     0   4777      0 --:--:-- --:--:-- --:--:--  4777
hello:croot:/:hello:cbranch:/:hello:cleaf:/

Summary:
  Total:	10.0008 secs
  Slowest:	0.0092 secs
  Fastest:	0.0008 secs
  Average:	0.0017 secs
  Requests/sec:	604.1521
  
  Total data:	259806 bytes
  Size/request:	43 bytes

Response time histogram:
  0.001 [1]	|
  0.002 [2003]	|■■■■■■■■■■■■■■■■■■■■
  0.002 [4036]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.003 [1]	|
  0.004 [0]	|
  0.005 [0]	|
  0.006 [0]	|
  0.007 [0]	|
  0.008 [0]	|
  0.008 [0]	|
  0.009 [1]	|


Latency distribution:
  10% in 0.0015 secs
  25% in 0.0016 secs
  50% in 0.0017 secs
  75% in 0.0018 secs
  90% in 0.0018 secs
  95% in 0.0019 secs
  99% in 0.0019 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0000 secs, 0.0008 secs, 0.0092 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0007 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0002 secs
  resp wait:	0.0015 secs, 0.0007 secs, 0.0091 secs
  resp read:	0.0001 secs, 0.0000 secs, 0.0002 secs

Status code distribution:
  [200]	6042 responses



Underload
  % Total    % Received % Xferd  Average Speed   Time    Time     Time  Current
                                 Dload  Upload   Total   Spent    Left  Speed
100    55  100    55    0     0   9166      0 --:--:-- --:--:-- --:--:--  9166
hello:croot:/load:hello:cbranch:/load:hello:cleaf:/load

Summary:
  Total:	10.0021 secs
  Slowest:	0.0085 secs
  Fastest:	0.0003 secs
  Average:	0.0009 secs
  Requests/sec:	1125.9655
  
  Total data:	484266 bytes
  Size/request:	43 bytes

Response time histogram:
  0.000 [1]	|
  0.001 [9194]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.002 [125]	|■
  0.003 [1034]	|■■■■
  0.004 [786]	|■■■
  0.004 [23]	|
  0.005 [74]	|
  0.006 [24]	|
  0.007 [0]	|
  0.008 [0]	|
  0.008 [1]	|


Latency distribution:
  10% in 0.0004 secs
  25% in 0.0004 secs
  50% in 0.0005 secs
  75% in 0.0005 secs
  90% in 0.0027 secs
  95% in 0.0029 secs
  99% in 0.0040 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0000 secs, 0.0003 secs, 0.0085 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0008 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0002 secs
  resp wait:	0.0008 secs, 0.0003 secs, 0.0084 secs
  resp read:	0.0000 secs, 0.0000 secs, 0.0002 secs

Status code distribution:
  [200]	11262 responses



  % Total    % Received % Xferd  Average Speed   Time    Time     Time  Current
                                 Dload  Upload   Total   Spent    Left  Speed
100   112  100   112    0     0     11      0  0:00:10  0:00:10 --:--:--    29
status[1/1],hello:croot:/load-status:status[1/1],hello:cbranch:/load-status:status[1/1],hello:cleaf:/load-status